[string_table]
100105=This program is corrupted, please visit www.futunn.com to download and reinstall.
100108=Loading...
100111=Futu Securities
100112=Futu Inc.
100121=On-line State
100122=On-line
100123=Off-line
100131=Futubull service interrupted:
100141=Connected
100142=Trying to reconnect..
100143=Connecting ...
100144=Reconnection Immediately
100147=Excellent
100148=Good
100149=Bad
100151=Upgrade Prompt
100152=The software must be upgraded immediately to continue. Do you want to upgrade now?
100161=Close Prompt
100162=Click the "close" do you want to:
100163=Minimize to taskbar, don't exit the program
100164=Exit Program
100165=Exit
100166=Are you sure to log out and switch to another account?
100167=Futubull is locked. Are you sure to log out ?
100171=When closing the main window:
100172=Mini Window
100173=The mini window automatically hides when docked
100174=Top Window:
100175=Main Window
100199=Continue
100200=Tips
100201=OK
100202=Cancel
100203=Yes
100204=No
100205=Apply
100206=Don't remind me again
100207=Name cannot be blank
100208=Name cannot be all blanks
100209=Abort
100210=Ignore
100211=Replace Confirmation
100212=Delete Confirmation
100221=Copy
100222=Paste
100223=Delete
100224=Rename
100225=Modify
100226=Save
100227=Copy data
100228=Export data
100231=Keep the window front
100241=Unlock
100242=Locked
100243=Unlock Trade
100244=Lock Trade
100245=Unlock Trade
100246=Lock Trade
100251=Sign out
100252=Done
100253=Send
100254=Turn off
100255=Transcript
100256=Unlock/Lock Trade
100257=Lock All
100258=Open Account
100259=Tap to add
100260=Cut
100261=Select all
100262=Got it
100263=Try again
100264=Keep both
100275=Unknown
100281=Account
100282=Cash
100283=Margin
100284=Margin
100285=Managed Account
100286=Buy on Margin
100287=Short Sell
100289=Unknown Type
100290=CN
100291=HK
100292=US
100293=A share
100294=SH
100295=SZ
100296=Simulation
100297=Upgrade to %s account
100298=Futu Northbound
100299=Futures
100300=:
100301=Date
100302=Y
100303=M
100304=W
100305=D
100308=All
100311=HKD
100312=USD
100313=CNY
100401=Jan
100402=Feb
100403=Mar
100404=Apr
100405=May
100406=Jun
100407=Jul
100408=Aug
100409=Sep
100410=Oct
100411=Nov
100412=Dec
100413=S
100414=M
100415=T
100416=W
100417=T
100418=F
100419=S
100420=Today
100421=Tomorrow
100422=The Day After Tomorrow
100423=Sun
100424=Mon
100425=Tues
100426=Wed
100427=Thur
100428=Fri
100429=Sat
100431=%d days,%d hours
100432=%d hours,%d minutes
100433=%d minutes,%d seconds
100434=%d seconds
100435=%d days
100436=Remaining
100440=None
100500=Server returns unknown error!
100501=Server response timeout!
100502=Network connection error!
100503=Network connection error or server returned timeout!
100511=Didn't find the stock price list, can not add or subtract prices!
100512=Didn't find the minimum number of shares, can not add or subtract number!
100601=Buy
100602=Sell
100603=Simulated buy
100604=Simulated sell
100605=Trade
100606=Short
100607=Buy Back
100611=Direction
100612=Symbol
100613=Name
100614=Price
100615=QTY
100616=Auction
100617=Sym
100621=shares
100622=Name
100623=unit
100624=One option =%s shares
100625=Name
100631=Actions
100651=MKT
100652=Bid1
100653=Ask1
100660=IM
100661=HKD AVL funds
100662=USD AVL funds
100663=Sell on Positions
100664=Short Positions
100665=IM
100666=HKD
100667=USD
100668=Sell
100669=Buy
100701=Group Settings
100702=Panels
100703=Window Settings
100721=Window Color
100722=Default Color
100751=Group Number
100752=No Group
100761=Display Mode
100781=Horizontal Mode
100782=Vertical Mode
100901=Me
100902=Simulation
100903=Quotes
100904=Markets
100905=Message
100906=Strategy
100907=Trade
100908=News
100909=Forum
100910=Live
100911=Set to open the separate window
100912=Set to open the inline window
100913=Data
101001=Confirm
101002=Warning
101003=Inquiry
101004=Error
101005=Notice
101011=Futubull
101012=Message
101013=Message
101021=Log in Settings
101022=Log Out
101023=Order Confirmation
101024=Most Used Quantity
101025=Choose a watchlist
101026=Futubull keyboard wizard
101027=Rolling Trade Confirmation
101030=User experience feedback
101031=New Characteristics
101041=Rename layout
101042=Save the current layout
101045=Save as template
101046=Template Management
101047=Rename template
101051=Rename panel
101052=Set panel name
101101=New TAB
101102=Fixed
101103=Cancel fixed
101104=Rename TAB
101105=Close TAB
101106=Close other TABs
101107=Close the left TAB
101108=Close the right TAB
101152=Mini Offer
101153=Watchlists
101154=Brokerage
101155=Select Stocks
101171=Stock Trading
101172=Trade
101173=Orders
101174=Conditional
101176=History
101177=Account
101178=Positions
101179=Sell Today
101180=Hour Clock
101181=Order History
101182=Transaction History
101183=LV2 Quotes
101184=Underlying
101185=A/C search
101186=WEB Module
101187=FullTick
101201=Brokerage Management
101202=Order Monitoring
101203=Transaction Record
101204=Look for the customer
101205=Transaction Monitoring
101206=Cash Margin
101207=Order Monitoring
101208=Transaction Record
101209=Look for the customer
101210=Margin Management
101211=Company Margin
101212=Margin Management
101218=Global Index
101219=CN
101220=US
101221=HK
101222=Watchlists
101223=Warrants
101224=Brokerage Monitoring
101225=Stock Details
101226=Stocks Stack Display
101227=Market Information
101228=SH-HK Connect
101229=SZ-HK Connect
101231=HK Trading
101232=HK Simulation
101233=Trader
101235=New Panel
101236=Professional Traders
101237=US Trading
101238=US Simulation
101239=A-share Trading
101240=Component Tag
101244=Save Layout
101246=My account
101247=IPOs
101248=Warrants
101249=My Portfolio
101251=HK Account
101252=US Account
101253=A-share Account
101255=Market News
101256=Live Broadcast
101257=Markets
101258=Industry
101259=Hot News Push Notificaiton
101260=Customize Stock
101261=Calendar
101262=University
101263=Stock Wiki
101264=Forum
101265=Live
101266=Announcement
101267=Dividend payout
101268=IPOs
101269=Warrants Analysis
101270=Mini Window
101271=My Futu
101272=Service
101273=Safe
101274=New Characteristics
101281=Management Center
101282=Application Management
101283=Layout Management
101284=Component Template Management
101291=System Settings
101292=Personal Information
101293=Basic
101294=Appearance
101295=Security
101296=Clear Cache
101297=Purview
101298=Reminders
101299=Trade
101301=Software Update
101311=Help
101312=Help Center
101313=Feedback
101314=About
101315=New Characteristics
101316=Privacy Policy
101317=Online Service
101318=Service Agreement
101323=Lock Software
101324=Unlock Software
101331=My account
101332=Account statistics
101333=Deposit
101334=Withdrawal
101335=Transfer\r\nStock In
101336=Transfer\r\nStock Out
101337=Daily Statement
101338=Monthly Statement
101339=Account Data
101340=IPOs
101341=Buy Lv2
101351=Change Password
101352=Change Trading Password
101353=Change Login Password
101361=Switch Account
101362=Log Out
101365=Open Main Window
101366=Open Mini Window
101367=Funds Transfer
101368=Trade(Pro.)
101369=Futures Trading
101370=Click Trade
101401=Failed to set trading password!
101402=Failed to unlock trade!
101403=Failed to lock trade!
101411=Order failed!
101412=Failed to get account information!
101413=Failed to get transaction records!
101414=Failed to get order records
101415=Failed to get conditional order records
101421=Order error!
101422=Failed to edit the order!
101423=Failed to cancel the order!
101424=Failed to expire the order!
101425=Failed to execute the order!
101426=Failed to delete the order!
101429=Failed to split the order!
101431=Failed to expire all order!
101432=Failed to execute all order!
101433=Failed to cancel all orders!
101441=Conditional order error!
101442=Failed to modify the conditional order!
101443=Failed to delete the conditional order!
101444=Failed to confirm the order!
101445=Close at rival price failed！
101446=Close at market price failed！
101451=Failed to get account list
101452=Retrying to get account list...
101471=Failed to get historical order records!
101472=Failed to get historical transaction records!
101481=Failed to get brokerage account list!
101482=Failed to get account list!
101483=Failed to get all transaction of system!
101484=Failed to get all orders of system!
101485=Failed to get all customers of system!
101486=Failed to send the credit!
101487=Failed to receive the credit!
101488=Failed to get the company margin total statistics !
101489=Failed to get the company margin position statistics !
101491=Failed to get transfer bank information!
101492=Failed to get bank transfer record!
101493=Bank transfer failed!
101494=Failed to link a-share account!
101495=Batch position close failed!
101496=Failed to get Maximum purchasing power, please click to retry again!
101497=Failed to get position record
101601=Login Service:
101602=Transaction Service:
101604=Quotes Service:
101611=Normal
101612=Disconnected
101661=Futubull ID:
101664=Last Login:
101665=Modify
101666=Phone no:
101667=Unverified
101668=(Verfied)
101669=Verify
101801=Open system settings
101802=Open application management
101803=Main Menu
101805=Message
101806=Deposit
101807=Click to open my account
101808=Sign in for coin
101809=Search Friends
101811=Password
101812=Futubull is locking......
101813=Please enter your login password to unlock it
101841=Watchlists
101842=Added
101851=Watchlists
101852=Contacts
101853=Apply/Application
101854=Message
101855=Short-Swing
101861=Futubull: %s(%lld)
101865=Self-built
101866=Edit
101870=Search: Stocks、Friends
101871=Contact
101872=Chat room
101873=Stock
101874=No stock or contact search results
101875=No contact search results
101876=No stock search results
101877=Suggested People
101878=No stock or target search results
101879=Please enter symbol/name
101921=Not grouped
101922=Group for selection:
101961=Able to open in separate window
101962=Click the triangle button or right button to set it to open as a separate window or set back to the embedded window.
101963=Main Menu
101964=Click here to open main menu,it includes settings, updates and other functions.
101965=Change Skin
101966=Click here to change skin
101967=Open mini window
101968=Click here to open mini or main window.
101969=Self-defined card
101970=You could drag the card to change positions and show hidden cards by managing cards on the right.
101971=Group trade panels
101972=[Trade]includes pad operation and more professional self-defined pads.
101973=Update the right bar
101974=The right bar is support to view news and comments
102001=Forgot password?
102002=Sign up
102003=Retrieve Login Password
102004=Sign up new futubull ID
102005=Log in
102006=Cancel
102007=Remember me
102008=Auto Login
102009=Log In
102010=Login with overseas phone number
102011=Login Futubull
102012=Logging in
102013=Login with overseas phone number
102021=Login failed
102022=Confirm
102023=Login failed for unknown reasons.
102024=Unable to connect to the server %s, please try setting it to automatically select and try again.
102025=Login failed, please check the network!
102026=Account or login password is incorrect!
102027=You've logged in this compuer, do not operate again!
102028=Server reject your login request, please try it later!
102029=Link and log in
102030=or Login with
102031=Common reasons
102032=Login has expired, please log in again
102033=Network Test
102035=Your login session has expired, please login again.
102036=OK
102039=Phone number
102040=choose username type to log in
102041=Futubull ID/Phone number/E-mail
102042=Password
102045=Please enter your ID
102046=Please enter you password
102047=Verification code(case insensitive)
102048=Refresh
102049=Optional
102051=Your account is forced to logout!
102052=Your account has been logged in on another device. The current login has expired. 
102053=Log In again
102054=Your password has been changed, please log in again. If it was not you, you are suggested to change password for security.
102055=Change Login Password
102056=Contact customer service
102057=Your account has been banned from login and forced to logout!
102058=Please contact customer service to help you.
102059=Got It
102081=SMS Verfication
102082=Verified phone number
102083=The phone is not nearby? Contact us.
102084=Do not receive verification code?
102088=Sending verification code
102089=Send verification code to %s?
102090=Sending...
102091=Send failed!
102092=Resend
102093=%ds
102094=SMS verification code has been sent. Please enter the verification code.
102095=Enter the vertification code
102096=Veritification failed!
102097=Server returned error data format
102101=Agent type
102102=server address
102103=ports
102104=Username
102105=Password
102106=Domain
102107=Test agent
102108=Stop testing
102109=No agent
102110=SOCKS4 Agent
102111=SOCKS5 Agent
102112=HTTP Agent
102113=Use Explorer agent
102114=Futu HTTP agent
102121=Please fill the right agent server address
102122=Please fill the right agent server port
102123=Agent server test pass!
102124=Agent server test failed!
102131=Server selection:
102132=Automatic server selection
102201=Futubull has locked
102202=Enter login password to unlock
102203=Incorrect login password
102204=Forget password?
102401=Password:
102402=Please enter your trading password
102403=Forget trading password?
102404=Account:
102405=Unlocked transaction
102411=Unlock Trade
102415=Dynamic token password
102416=dynamic password
102417=Cannot use dynamic password?
102418=Veritification code:
102419=Click to refresh veritification code
102420=Please enter token password
102421=You don't have trading permission, please open account.
102422=Open account
102423=Enable trade
102424=Your open accout files has submitted, but it is not opened yet,please waiting staff to deal with.
102425=You haven't opened US trade yet.
102426=Open US trade
102427=Offer for new clients
102428=Your account is not enabled before risk disclosure. Please finish it as soon as possible.
102429=Go to finish Risk Disclosure
102430=You have not set trading password yet. For your fund security, please set your trading password  before trade.
102431=Upgrade account
102441=Set Password
102442=Futubull desktop version does not support resetting the trading password of your Futu Inc. account at the moment. If you need to do so, please reset through the Futubull mobile version.
102501=Derivative products risk disclosure
102502=Equity risk disclosure
102503=Penny stocks risk disclosure
102511=Derivative products like warrants and bull / bear contracts have high risks, please acknowledge and confirm the risks before trading.
102512=I received training on derivative products in the past
102513=I had job experience related with derivative products
102514=I traded derivative products more than 5 times during past three years
102521=Equity is not stock, it is possible to lose all your funds, please acknowledge and confirm the risks before trading.
102522=Rights are different from stock, it has high leverage and short trading days, you'll lose all initial investments if you choose not to buy the stocks by the exercise date.
102523=Between the payment date and the share distribution date, investors must take the risks of falling stocks price.
102524=Investors must pay attention to payment and distribution date related to right offering, FUTU will only give notice on courtesy.
102531=Penny stocks have following risks which might result in significant loss, please acknowledge and confirm related risks before trading.
102532=HK and US stocks puts no limitation of price change, penny stocks price may fluctuate significantly during trading hours.
102533=Penny stocks usually have low turnover rate and high liqudity risks.
102534=Penny stocks have higher chance of delisting than normal shares.
102535=In response to Securities and Futures Commission requirements, please complete risk disclosure before closing the reminder.
102541=Confirm
102542=Cancel
102543=I understand the risks above.
102550=Grey market trading reminder
102551=Grey market trading has inherit risks because it is over-the-counter-trading before stock listing. Please confirm risks before placing deals.
102552=Confirm
102553=Reminder: During the grey market trading, position market value,profit and loss will be calculated with the latest grey market price. Please notice: System will swith back to the Exchanges Price(Issue Price) after 24:00 of the grey market trading day, the causing changes of market value,profit and loss will not influence your actual assets. Click to know more.
102554=Derivative products Trading Assessment
102555=In order to ensure that you have enough understanding about relevant risks, you need to complete the derivatives trading evaluation before transaction.
102556=Start Assessment
102557=Confirm risks
102558=The trading behavior has high risks, pleace confirm the risks.
102559=Confirm
102560=Reminder
102561=%s The current minimum commission price is %s， and your offer of %s may not be submitted to the exchange. Please modify it to the integral multiple of the minimum change unit and submit it again.Do you want to continue?
102562=continue
102563=The price you set is %s higher than the current market price. Do you want to continue submitting it?
102564=The price you set is %s higher than the current market price. Orders that deviate too much from the market may be rejected by the system. Do you want to continue submitting it?
102565=Price deviation reminder
102566=The price you set is %s lower than the current market price. Do you want to continue submitting it?
102567=The price you set is %s lower than the current market price. Orders that deviate too much from the market may be rejected by the system. Do you want to continue submitting it?
102900=Day Trade Alert
102901=If you submit this order, it will be your third day trade. To prevent being marked as a PDT, you will not be allowed to open new positions until your account have a day trade available. Continue submitting?
102902=Learn more.
103001=B
103002=S
103003=Buy on Cash
103004=Sell on Cash
103005=Available Cash Buy
103006=Available Margin Buy
103007=Short Sell on margin buy before
103008=Available Sell
103009=Short Sell on Margin
103010=Zero
103011=Buy on Margin
103012=Sell on Positions
103013=No matched stock
103014=No history!
103015=Early bid need to trade betwen 9:00-9:20, change or cancel the orders are not available after 9:15. Closed bid need to trade betwen 16:01-16:10, change or cancel the orders are not available after 16:06.
103016=Early bid need to trade betwen 9:00-9:20, change or cancel the orders are not available after 9:15. Closed bid need to trade betwen 16:01-16:10, change or cancel the orders are not available after 16:06.
103017=Market order will be placed by market price, you don't have to enter the price.
103018=Trailing Stop Order depends on the type you place while triggering the order.
103019=During pre-opening morning session, at-auction orders need to be placed between 8:45-9:13, and orders can't be amended or canceled after 9:11. During pre-opening afternoon session, you can only place orders between 12:30-12:58, and orders can't be amended or canceled after 12:56. Unmatched auction orders will be converted to limit orders at Calculated Opening Prices(COP) on the market open.
103020=The futures trading period is %s, please place the order during this time in trading day.
103021=Trigger condition
103022=Trading is not allowed in the current period.
103023=Available Short Sell
103024=The order on the left will be placed while the price reach the prices below.
103025=Before closed trading today
103026=Before %s closed trading today
103027=What is Stop Order? Click here to know more.
103028=The order you placed contains odd lots(less than one board lot). If you want to continue, pleace change the order type to"Odd Lot Order'.
103029=More about odd lot trade
103031=LMT Price
103032=MKT Price
103033=Follow Bid 1
103034=Follow Ask 1
103037=Set follow prices
103038=Following prices, click to stop follow.
103039=Stopped following prices, click to start following.
103041=Grey Market Order(Futu Securities)
103042=Grey Market Order(Phillip Securities)
103043=Grey Market Order
103044=Limit Price Committed
103045=Pre-MKT Buy
103046=Pre-MKT Sell
103047=Post Mkt Buy
103048=Post Mkt Sell
103049=Show all types
103050=Type
103051=Limit Order
103052=Limit Price Buy
103053=Limit Price Sell
103054=Stop Order
103055=Stop Order Buy
103056=Stop Order Sell
103057=At-auction Market Order
103058=At-auction Market Buy
103059=At-auction Market Sell
103060=At-auction Limit Order
103061=At-auction Limit Buy
103062=At-auction Limit Sell
103063=MKT Order
103064=MKT Buy
103065=MKT Sell
103066=Trailing Stop Order
103067=Enhanced
103068=Pre-mkt
103069=Post Mkt Trading
103070=Odd Lot Order
103071=Buy 1/4
103072=Buy 1/2
103073=Buy 3/4
103074=Buy All
103075=Sell 1/4
103076=Sell 1/2
103077=Sell 3/4
103078=Sell All
103079=Most Used QTY
103080=Settings
103081=Click to refresh lateset quotes(Without Trade level data)
103082=Click to refresh lateset quotes(Without Trade level data). \r\nRefresh times in this month has been used up.
103083=Click to refresh lateset quotes(Includes Trade level data). \r\nYou can refresh %d times this month. (%d times in total)
103084=Sent
103085=Tip reference \r\n You'll have profit about %s if you sell at this price.
103086=Tip reference \r\n  You'll have loss about %s if you sell at this price.
103087=Click to choose type
103088=The margin trade of this stock is not available.
103089=Pre-market Trading need to be placed in ET %s-%s, it's ET 
103090=Post Mkt Trading need to be placed in ET %s-%s, it's ET
103091=Simple Mode
103092=Ordinary Mode
103095=It'll use margin if buying.
103096=It'll be short sell margin if selling.
103097=Odd lot orders are manually matched in the exchange, the deal price will generally worse than the market price. Please wait patiently for the transaction. Appropriately buy high or sell low can increase the opportunities to close the deal.
103098=Learn more.
103099=Dark trading session is 16:15 to 18:30. Cash from dark trading can't be used for trading other stocks, and this part of capital will be unclocked after the stock is listed.
103100=Learn more.
103101=Amount
103102=Amount
103103=(Reference Rate %s)
103104=It'll be short sell if selling
103110=Conditional Order Details
103111=Trigger
103112=%s before closed, price reaches %s will trigger to set order.
103113=%s before closed, price drops %s will trigger to set order.
103114=Before %s, price reaches %s will trigger to set order. 
103115=Before %s, price reaches %s will trigger to set order. 
103120=Rolling quantity
103121=Rolling symbol
103122=Close symbol
103123=Close quantity
103124=Reference
103130=Is short sell allowed?
103131=Notice:
103132=1. If short sell is allowed, after the condition is triggered and the order is placed,the position of the current stock will become -%s shares (short).
103133=2. Please note that customers with short positions may be at risk of being closed without prior notice.
103134=3.If the conditional order short sell confirmation is turned off, short sell is not allowed by default.
103141=(Too far from the market price)
103142=(Quantities are not full-hands)
103143=(Triggered price is too far from MKT)
103144=(invalid price)
103145=Exp.Date:
103146=Strike:
103147=(high buy price)
103148=(low selling price)
103149=Do not support exercise, please close the position before the date of delivery
103151=Order amount exeeds the maximum cash purchasing power, %s shares will use margin.
103152=Order amount exeeds the maximum cash purchasing power, exceeding part will use margin.
103153=After the order is placed, the position of the current stock will become -%s shares(short). Please note that customers may be at risk of being closed without prior notice.
103154=After the order is placed, the position of the current stock will become short. Please note that customers may be at risk of being closed without prior notice.
103155=After the order is placed, the position of the current option will become -%s shares(short). When the buyer of an option exercises in advance, the seller as an option is obliged to receive assignments and exercise advance exercises.
103156=After the order is placed, the position of the current option will become short. When the buyer of an option exercises in advance, the seller as an option is obliged to receive assignments and exercise advance exercises.
103157=The maximum return on short-selling option operation is all option rights obtained when short ingest, and the maximum loss may be very large as the contract price continues to rise. Please trade with caution.
103158=After the order is placed, the position of the current future will become %s (short). You can not use short selling reminder by setting order placing. Please note that customers with short positions may be at risk of being closed without prior notice.
103159=%s before closed, MKT order will be placed if the price increases ＞%s
103160=%s before closed, LMT order will be placed if the price increases ＞%s
103161=Submit Confirmation
103162=When triggering, MKT go down 
103163=%s before closed, MKT order will be placed if the price falls ＞%s
103164=%s before closed, LMT order will be placed if the price falls ＞%s
103165=When triggering, MKT increase
103166=ADR Trading Disclosure
103167=According to regulatory obligations, different exchanges have different price restrictions on ADR (such as the purchase price limit or the sell price limit), which may result in delay or failure to execute the transaction. If this happens, please try to place an order again. Or contact online customer service.
103168=Holding ADR may incur an ADR hosting fee, which is generally charged at the end of each year.
103169=Learn about ADR Depositary Services Fees
103171=If price fall more than
103172=Please enter the fall price
103173=What is Trailing Stop Order? Click here to know more.
103174=Auto submit
103175=Mkt Price
103176=Limit Order
103177=MKT trading Order \r\nDeal automatic in MKT
103178=The price of \r\nCommon trading order= MKT while triggering-Specify Spread
103179=Spread
103180=(Notice: Exceeded quantity)
103181=Positions
103182=Buy
103183=Buy
103184=Short Selling
103185=Sell
103186=Close
103187=For the first
103188=Rival Price
103189=Market Price
103190=MKT
103191=Close first, then buy (Reverse)
103192=Close first, then sell (Reverse)
103193=Close first, then buy (Rolling)
103194=Close first, then sell (Rolling)
103195=Buy (Close)
103196=Sell (Close)
103197=Before %s, LMT order will be placed if the price falls ＞%s
103198=Before %s, LMT order will be placed if the price increases ＞%s
103201=Set Most Used Positions
103202=HK stocks customize filled quantities
103203=US stocks customize filled quantities
103204=A stocks customize filled quantities
103210=Quantity
103211=Follow market price
103212=Order confirmation Cancel
103213=Clicking the operation after closing will directly submit the order. There is a risk of misoperation while increasing the ordering speed. Please choose carefully.
103214=Confirm
103215=Order confirmation
103216=Close(rival)
103217=Close(MKT)
103218=Support one-click price trading, click to view
103219=Order operation: click the column of bid qty / ask qty, that is, buy / sell operations at the corresponding price; \r\nOrder change operation: For my buy orders / my sell orders column, click and hold the left mouse button and drag it; \r\nClick into the help center to learn more
103221=Most Used 1
103222=Most Used 2
103223=Most Used 3
103224=Most Used 4
103225=Most Used 5
103226=Most Used 6
103227=Most Used 7
103228=Most Used 8
103229=Most Used 9
103230=Most Used 10
103241=A hand
103245=More
103251=1/4 Available Buy
103252=1/2 Available Buy
103253=1/4 Margin
103254=1/2 Margin
103255=1/4 Buy Back
103256=1/2 Buy Back
103257=1/4 Sell
103258=1/2 Sell
103259=1/4 Short Sell
103260=1/2 Short Sell
103270=Choose markets to set most used quantity
103271=Markets
103272=HK
103273=US
103274=CN
103275=Please set most used quantity
103280=Choose markets to set most used amount
103281=Set most used amount
103301=Get Lv2
103302=Buy Lv2
103311=HK stocks Lv2 can offer realtime quotes. Click to get it if needed.
103312=Congrates to get %d chances to click quotes. Click to get LV2 realtime quotes if needed.
103313=Your chances to click quotes has been used up, Click to get LV2 realtime quotes if needed.
104001=Not opened yet
104002=Request to open account
104003=Coming soon
104004=Normal
104005=Trading prohibited
104006=Login prohibited
104007=Trading turned off
104008=Risk Disclosure Needed
104101=Futubull ID
104102=Name
104103=Account status
104104=Account type
104105=Net Assets
104106=Security Value
104107=Cash
104108=Available Balance
104109=Fund on Hold
104110=Buying Power
104111=Credit Limit
104112=Stock mortage
104113=Funds owed
104114=Currency
104115=Statement
104116=Settled
104117=Unsettled
104118=Used quota
104119=Borrowable quota
104120=Every stock's margin amount is different,because the purchasing Power of margin account is decided by the stock you bought.
104121=Margin Ratio
104122=Variation Margin
104123=Click to know what's Margin Ratio
104124=Buying Power
104125=Short Sell Power
104126=Overnight Risk Ratio
104127=Click to know what's Overnight Risk Ratio
104128=LMV
104129=SMV
104130=Variation Margin
104131=Nickname
104132=Nickname
104133=ID number
104134=Business ID
104135=Share of the market value of net assets
104136=Margin Loan
104137=Risk Level
104138=Click to know accouts' risk level.
104139=Day Trade Left
104140=Beginning DTBP
104141=Remaining DTBP
104142=Available Funds
104143=Unrealized P/L
104144=Realized P/L
104145=IM
104146=MM
104147=HKD Cash
104148=HKD AVL BAL
104149=USD Cash
104150=USD AVL BAL
104151=DT Call Amount
104155=Reset
104156=Loading failed. Please try again later
104157=Setting failed. Please try again later
104158=Learn More
104159=Simulation asset reset
104170=Safe
104171=Safe
104172=Safe
104173=Low Risk
104174=Medium Risk
104175=High Risk
104176=Warning
104177=Margin Call
104178=Max Withdrawal
104179=Available Balance
104180=Unify
104181=Unified
104201=Quality@Price
104202=Available QTY
104203=Market Cap
104204=P/L
104205=% Chg
104206=Today's Turnover
104207=Today's Purchase@Avg Price
104208=Today's Sales@Avg Price
104209=Today's P/L
104210=Cost
104211=Cost = (Total Purchase - Total Sales) / Quantity
104212=Margin Rate
104213=View
104214=Opening Price
104215=Currency
104216=Liquidate at rival price
104217=Liquidate at mkt price
104218=Are you sure to liquidate %s's positions at rival price?
104219=Are you sure to liquidate %s's positions at mkt price?
104220=Open up positions
104221=Close up positions
104222=Close at rival price
104223=Close at mkt price
104224=Close at specific price
104225=Rev(rival)
104226=Rev(MKT)
104227=Rolling positions(rival)
104229=Specific price
104230=Rolling code
104231=Rolling quantity
104232=More actions
104233=Reversing Trade(Close)
104234=Reversing Trade(Open)
104235=Rolling Trade(Close)
104236=Rolling Trade(Open)
104237=Total contracts selected: 
104238=Cancel batch closing
104239=Risk warning:
104240=Batch closing is a convenient online trading method provided by Futu for customers, but because multiple orders are involved, and the position status may be continuously updated under user operations, Futu does not guarantee the final operation result.
104241=Are you sure to close %s's selected positions at rival price?
104242=Are you sure to close %s's selected positions at market price?
104250=Show Trend Preview
104251=Show Stocks with Quality 0
104301=Default Mode
104302=Mini Mode
105010=Cancelled
105011=Pending
105012=Filled
105013=All
105014=All Expired
105015=All Effective
105016=All Cancel
105017=My Order
105018=Show My Order Only
105019=Batch Closing Order
105100=Order Type
105101=Order Price
105102=Order QTY
105103=Trading Status
105104=Filled@Avg Price
105105=Order Time
105106=Order ID
105107=Order Source
105111=Filled
105201=Edit
105202=Expired
105203=Effective
105204=Cancel
105205=Delete
105221=Other operations are in progress, please try again later!
105225=Auction
105226=MKT Order
105301=Price
105302=Filled Quantity
105303=Filled Amout
105304=Filled Time
105305=Opponent
105306=Transaction ID
105400=Submitting
105401=Processing
105402=Pending
105403=Partially Filled
105404=Filled
105405=Expired
105406=Cancelled
105407=Deleted
105408=Failed
105409=Time Out
105410=Server time out, the processing result is unknown
105411=Network error, failed to send
105412=Partially Cancelled
105413=Cancelled
105414=The server returned an unknown error and the processing result is unknown.
105415=No position
105420=System Liquidation
105430=Odd lot orders are manually matched in the exchange, the transcation speed will be worse than the whole lot orders. Please wait patiently for the transcation.
105431=It is Pre-opening session. The limit order (enhanced) you submitted will be queued to the exchange after the official opening (9:30 am).
105432=Order queue reminder
105433=Orders will be queued up for submitting after market opening. Please wait patiently.
105450=Without reporting
105452=Reported
105453=Reported to be cancelled
105454=Partially to be cancelled
105471=Other Type
105472=Others
105521=The order quantity exceeds the limit and cannot be submitted in one order. Can it be automatically split into mutiple orders?
105522=Your order price is too far from the market price. Do you want to continue?
105531=Are you sure to take all expired orders effect?
105532=Are you sure to invalidate all normal orders?
105533=Are you sure to cancel all cancellable orders?
105534=Are you sure to take the order effect?
105535=Are you sure to invalidate the order?
105536=Are you sure to cancel the orders?
105537=Confirm cancellation of the selected orders?
105601=Status
105602=Trigger Condition
105603=Price
105604=Quantity
105606=Trigger Time
105607=Update Time
105621=Modify
105622=Delete
105623=Export
105631=Waiting
105632=Triggered
105633=Failed
105634=Expired
105642=Before %s, decline exceeds 
105643=Before %s, price rise to 
105644=Before %s, price falls to 
105645=Before %s, increase exceeds
106001=General Settings
106002=Confirmations
106003=Most Used Quantity
106004=Skin Style
106005=Automatic Lock
106006=Change Password
106007=Hotkeys
106008=Window Settings
106009=Color Display
106010=Special / Other
106011=Risk Control
106012=Anti-disturbance
106013=Watchlists
106014=Futu Token
106015=Add and Subtract Amplitude of Quality
106016=Default Fill Quality
106017=Most Used AMT
106018=Font Style
106019=Software Scaling
106101=Language Selection:
106102=简体中文
106103=繁體中文
106104=English
106105=Quote Color:
106106=Red Up/Green Down
106107=Green Up/Red Down
106108=Special Display:
106109=Enable Price Flashing
106110=Enable Brokers Ranking Color Matching
106121=Login Settings:
106122=Automatically launch Futubull on start-up
106123=Automatically login when launching Futubull
106124=Update Settings:
106125=Allow Beta update reminders
106151=Mini window and main window:
106152=Can only switch to each other only
106153=Can open at the same time
106201=Please select the operation need to confirm:
106202=Submit order confirmation
106203=Cancel order confirmation
106204=Validate, invalidate order confirmation
106205=Margin confirmation
106206=Exit Confirmation
106207=Cancel all confirmation
106208=Validate, invalidate all confirmation
106209=Delete Watchlists Confirmation
106210=Close Live Window Confirmation
106211=Short sell confirmation
106212=High-buy low-sell transaction confirmation
106213=Failed prompt mode:
106214=Pop-ups
106215=Floating window in the bottom right corner
106216=When I Place the 3rd daytrade
106217=Pattern Day Trade Protection
106218=MKT order transaction confirmation
106219=Conditional order short-sell conformation
106221=Transaction operation confirmation setting item
106222=Settings
106223=Deviation of order price confirmation
106228=Use pre-market and post-market prices in US market
106229=Use pre-market prices
106230=Use post-market prices
106231=When a normal order is placed, if the order quantity exceeds the limit, the order will be automatically split into multiple orders.
106241=Buy bottom: You'll Buy on Margin if buying power is insuffient
106242=Sell bottom: You'll Sell on Margin if positon is insufficient
106243=Your purchasing power is insufficient, the quantity has been automatically changed to Buy on Margin.
106244=Your position is insufficient, the quantity has been automatically changed to Sell on Margin.
106245=Buy and sell button respond to double click
106246=Auto-fill by sell on margin if no filled quantity
106247=Quickly edit: You'll Buy on Margin if buying power is insufficient
106248=Auto-add stocks purchased to Watchlists
106249=Close Margin Reminder
106250=After closing, you will no longer receive a margin reminder when placing an order. Are you sure to close?
106251=Close Short Selling Reminder
106252=After closing, you will no longer receive a short selling reminder when placing an order. Are you sure to close?
106253=Short selling risk warning: Short selling customers may face the risk of short positions being closed at market price without prior notice.
106254=1.You are using market order. Please note that there is no guarantee on the transaction price of market order. This means that your order may be sold at any price.
106255=2.The market order may be split into several small orders for execution, each of which may have a different final transaction price.
106256=3.If the stock liquidity is poor or there is no quote, the market order may be unable to transact and thus be withdrawn, please keep your attention.
106301=Set Most Used Quality:
106401=Automatic Lock:
106402=Turn On
106404=Lock Screen Timeout:
106405=Mins
106406=If the keyboard or mouse does not work within the timeout period, the software will be automatically locked. Once locked, please enter the password again to unlock.
106501=Skin Style:
106502=Elegant Silver Gray
106503=Dark
106504=Blue
106505=Purple
106521=Change Skin
106601=Change Password:
106602=In order to ensure the security of your account, please click the link and enter Futu website to change your password.
106603=Change Login Password
106604=Change your login password. You will need to login again after the modification.
106605=Change trading password
106606=Any operation involving transactions or funds requires a trading password. After the modification, you will need to unlock the trade again.
106702=Who can friend me:
106703=Allow anyone
106704=Need to verify information
106705=Allow no one
106710=Messages
106711=Message reminder settings:
106712=Turn off the avatar flash
106721=Who can view your watchlists:
106722=Public
106723=All Friends
106724=Private
106731=Badge
106732=Who can see my badge level:
106733=This will only influence HK, US and Trade Badges
106801=Sound
106802=Reminder content
106803=Order reminders
106804=Deal reminders
106805=Price reminders
106806=Conditional trigger reminder
106821=Data Display
106822=Quantity Abbreviation:
106823=Chinese(万，亿)
106824=English(K, M)
106825=Special format:
106826=1/32 Points (US bond futures, etc.)
106830=List Field
106831=Custom Stock List Field
106832=Restore Default
106851=Official Accounts
106852="Reminder" official accounts message receiving settings:
106853=Receive order deal reminders
106854=Receive no commission seed reminder
106855=Receive price reminder
106856=Receive stock movement reminder
106857=Receive derivatives expiration reminder
106858="Hot News" official accounts message receiving settings:
106859=Receive push
106860=Receive conditional trigger reminder
106881=Enable Futu token to increase your tradking security.
106882=Connect FUTU token
106883=To use the token dynamic password on the client, you need to bind Futubull account to Futu Token application.
106884=Turn on FUTU token
106885=You need to bind the token dynamic password before enabling it.
106886=Turn off Futu Token
106901=Choose Font Style:
106902=Classic
106903=Modern
106904=Note: you need to quit and login again to take effect.
106911=Custom Scaling
106912=Consistent with system scaling (DPI settings)
106913=Change the size of window, font and image
106914=%
106915=(Range: %d%% - %d%%; Optimal ratio: %d%%)
107001=Enter symbol / name
107002=The number of stocks in watchlists has reached the maximum limit!
107003=Search: Friends/Groups
107004=Friend
107005=Group
107006=No search result
107007=Group member
108001=Open Cash
108002=Open MV
108003=Filled Orders
108004=Total Turnover
108005=Total P/L
108006=Today's P/L%
108007=Today's P/L Ratio = Total profit and loss today / (Opening Cash + Opening Maket Value)
108008=Open HKD Cash
108009=Open USD Cash
108010=Filled On Buy Orders
108011=Filled On Sell Orders 
108012=Long Positions
108013=Short Positions
108014=Total HKD P/L
108015=Total USD P/L
109001=Number of Orders
109011=Number of Filled Orders
109012=Turnover
109013=Number of filled orders %d
109014=Turnover(HKD)
109015=Turnover(USD)
109021=Enter symbol lookup
109031=Range:
109032=To
109033=Results:
109034=Filter:
109051=Query all this month
112001=Futubull ID, account ID，name
112101=Management account
112201=Update Time
112202=Freeze sort
112203=Unfreeze sort
112251=Total customers: %d Matching results: %d
112301=Opening net asset
112302=Dynamic profit and loss ratio
112303=Dynamic profit and loss amount
112304=Position ratio
112305=Peak profit amount
112306=Peak profit ratio
112307=Peak loss amount
112308=Peak loss ratio
112321=Message
112351=Send a message to %s(%s):
112352=%s(%s) says to you:
112354=Sending content cannot be empty!
112355=The message has been successfully sent!
112356=The message failed to send!
112403=Used loan amount
112404=Loan ratio
112405=Margin ratio
112406=Current risk level
112407=AL
112408=MC
112409=Variation Margin
112410=Cut positions reference amount
112411=Issuing credit
112412=Recycling credit
112413=Close the position
112421=Cash Margin Call Warn
112422=There are %d accounts with cash margin red risk!
112423=The system will recycle your intraday cash credit at %s
112424=Important Prompt
112431=Excess liquidity
112432=Maintenance margin (MM)
112433=Available funds
112434=Initial margin (IM)
112435=Margin Call remaining
112436=Margin Call Margin (MCM)
112437=Net asset/Market value
112501=Total used margin:
112502=Total available cash:
112503=Maximum margin amount:
112504=Total number of margin accounts:
112505=Number of used margin accounts:
112506=Margin Call :
112507=Forced liquidation:
112508=Total amount of insurance:
112520=Stock mortgage statistics
112521=Mortgage rate
112522=Mortgage amount
112523=Total mortgage
112524=Pledge ratio
112525=User number
112531=Number of margin call accounts:
112532=Number of forced liquidation accounts:
112533=Margin Call pop-up reminder
112534=Turned on
112535=Turned Off
112536=All accounts
112537=All margin call accounts
112538=Forced liquidation accounts
112539=Margin Call accounts for 1 consecutive day
112540=Margin Call accounts for 2 consecutive days
112541=Margin Call accounts for 3 consecutive days and above
112542=Number of closed accounts:
112543=Number of red accounts:
112544=Number of yellow accounts:
112545=Batch closing
112546=Cancel All
112547=Be careful, please be careful!
112548=These selected (%d) accounts will be forced to liquidate, are you sure to continue?
112549=Add all
112550=Remove all
112551=Closing the position in progress...
112552=Are you sure you want to remove all?
112553=Number of light purple accounts:
112554=Number of deep purple account:
112560=HK margin call warning
112561=There are %d HK margin account showing a red risk! There are %d HK margin accounts showing a yellow risk!
112562=US margin call warning
112563=There are %d US margin accounts showing a red risk! There are %d US margin accounts showing a yellow risk!
112800=Call
112801=Dial number
112802=Do you want to call the user?
112803=Phone dialing
112804=Landline dialing
112805=Calling... please wait...
113001=Futubull
113003=Futu Network
113004=http://www.futunn.com
113005=© 2020 FUTU.
113006=Trial Version
113011=CSV file (*.csv)|*.csv|text file (*.txt)|*.txt|all files (*.*)|*.*||
113012=All rights reserved
113013=User Agreement
113501=Time setting
113511=The trading window is displayed to the left
113512=The trading window is displayed to the right
113801=Add an account
113802=Open an A-share account
113803=Unbinding an A-share account
113804=Are you sure to unbind the %s A-share account? (fund account: %s)
113805=Bind successfully!
113810=Broker:
113811=Account:
113812=Trade PWD:
113813=Please enter a fund account
113814=Please enter trading password
113821=Binding
113822=Open
113823=Back
113824=Can directly trade northbound stocks through Futu
113825=A-share Securities Account
113826=Support Great Wall Securities, Ping An Securities
113827=Scan QR code to open an account
113828=Add
113829=Futures Account
113830=Open futures account within 3 minutes, supports futures transactions.
113831=Ping An Securities
113832=Great Wall Securities
113841=Bank-Securities\r\nTransfer
113842=Bank Name
113843=Bank Account
113844=Trasnferable Amount
113845=Transfer Amount
113846=Bank Password
113847=Fund Password
113851=Deposit
113852=Withdraw
113853=Note: If you enter the wrong password too many times, your account will be locked and you need to unlock it at the bank counter.
113854=Required
113855=Your application has been submitted, please check the transfer result in the transfer inquiry!
113860=No Change
113861=Securities transfer to bank
113862=Bank transfer to securities
113863=Others
113864=Today's transfer inquiry
113871=Without reporting
113872=Reported
113873=Success
113874=Fail
113875=Time Out
113876=Waiting for correction
113877=Has been corrected
113878=Adjusted to success
113879=Adjusted to fail
113891=Date
113892=Time
113893=Transfer amount
113894=Business name
113895=Status
113896=Remarks
113902=Fund account
113910=Not added
113911=Not Connected
113912=Disconnected
113921=Buy today
113922=Sell today
113945=Refresh all data of A shares
113946=\r\nLast update time: %s
113981=Select Symbol
113982=Symbol
113986=A-shares (SZ)
113987=B-shares (SZ)
113988=A-shares (SH)
113989=B-shares (SH)
113990=Holding %s %s shares
114500=Unbind\r\naccount
114501=History\r\nRecord
114502=Currency\r\nExchange
114503=Application quota
114504=Subscription\r\nof New Shares
114505=Apply for a\r\nRights Issue
114506=Stock\r\nSelection
114507=My\r\nCommission
114508=Real-time\r\nQuotes
114509=Invitation\r\nRelationship
114510=Futubull Mall
114511=Advanced\r\nMarket
114550=Capital
114551=Stock
114552=Others
114574=Fold
114575=Unlock to view account information
114576=Not yet open an account
114577=No account information can be displayed, immediately open an account to send a commission
114578=Open trading permission
114579=Opening an account
114580=The account has not been completed yet, please complete the necessary process or wait for the review to be completed.
114581=Congratulations! Your account information has been reviewed.
114582=Complete the risk disclosure online to open an account successfully
114583=Complete risk disclosure
114584=Add an A-share account
114587=View account opening progress
114590=Application
114591=(Support Great Wall Securities, Ping An Securities)
114593=Commission-free\r\nTrading
114594=Free commission\r\nLow financing interest
114595=$0.01/share\r\nLow commission
114596=Flexible choose multiple\r\ncommission plans
114597=Invested by Tencent\r\nLicensed Broker
114598=Regulated by SFC and protected by\r\ninvestors compensation fund
114599=Invested by Tencent\r\nSFC regulation
114600=SIPC compensation is up\r\nto $500,000/customer
114601=No limited\r\ndeposit requirement
114602=Support trading without\r\nany deposit amount
114603=Support Margin\r\nShort selling
114604=Ultra-low margin interest
114605=Open Account
114606=Continue to open an account
114607=To Open
114608=under review
114609=Success
114610=Stand by
114611=$0 Commission
114612=Investing in Stocks, Options, ADRs\r\nand ETFs with 0 commission
114613=Member of FINRA/SIPC
114614=Your Account is Protected\r\nup to $500,000
114615=Free Level II Quotes
114616=Real-time Data and\r\n50+ Technical Indicators
114617=Open Account with zero commission
114618=Enjoy $0 Commission fee on investing stocks, options, ADRs and ETFs
114619=Multi-Currency Transactions
114620=You can use US dollars or HK dollars\r\nto trade HK stocks
114621=High-Capacity Channel
114622=Direct connection to the Exchange, only\r\nneed 0.0037s to place an order
118000=layout
118001=Name:
118002=Number of displays:
118003=Primary display resolution:
118004=Last use:
118005=Last save:
118006=Postscript:
118021=Name
118022=Number of displays
118023=Last use
118024=Last save
118025=Postscript
118031=Last layout
118032=Current layout
118033=My layout
118034=History layout
118035=Save current layout
118036=Apply this layout
118037=Restore last layout
118038=Has not saved the layout yet
118043=A layout with this name already exists, please use a different name
118044=Saving layout failed!
118051=The layout "%s" already exists. Do you want to replace it?
118052=Are you sure you want to permanently delete the layout "%s"?
118054=The number of layouts has reached the maximum limit. Please delete the layout without saving.
118101=Save as template
118102=Template management
118103=Loading system template
118104=Load my template
118105=Load the tab you are using
118106=Load recently closed tabs
118107=More...
118108=Export to
118109=Load local template
118111=Name:
118112=Current tab:
118121=Name
118122=Last use
118123=Last save
118143=A layout with this name already exists, please use a different name
118151=The layout "%s" already exists. Do you want to replace it?
118152=Are you sure you want to permanently delete the layout "%s"?
118153=Please select an item first!
118154=The number of templates has reached the maximum limit. Please delete the template before saving.
118155=Lock the current page component
118156=The page is locked, right click to unlock, and other editing operations can be performed.
118157=Template import failed
118158="%s" template data error could not be resolved
118310=Pop up as a separate panel
118313=name:
118314=A panel with this name already exists, please use a different name
118315=Display toolbox
118316=Hide toolbox
118317=Turn off magnetic
118318=Turn on magnetic
118319=Watch the video tutorial
118320=Refresh all data
118321=Refresh trading account data
118381=Toolbox
118382=General
118383=HK
118384=US
118385=A-Shares
118391=Empty component
118501=Next
118502=Previous
118503=Feature Tips:
118504=%d prompt, total %d
123101=Settings
123102=Shortcut key settings
123103=Press the keyboard directly to set
123104=Reminder when other software occupies shortcut keys
123105=Not set
123106=Already occupied by other software
123108=Restore default settings
123109=None
123110=It is detected that other software occupies the shortcut key. It is recommended that you modify the shortcut key of the conflict software to ensure that the function of Futubull is available
123111=Due to the software upgrade, Futubull's shortcut has been reset to the default settings. If you have used a custom shortcut, please revisit it
123112=Due to software upgrades, some of Futubull's shortcuts have been abolished. If you have a Futubull's shortcut, please revisit it
123113=Normal
123114=Modify Futubull's shortcuts
123115=Set Futubull's shortcuts
123116=Futubull's shortcut definition
123121=Enable common shortcuts
123122=Enable trading shortcuts
123123=Enable market shortcuts
123131=Common shortcuts
123132=Trading shortcuts
123133=Market shortcuts
123151=Function Description
123152=Key setting
123153=Note
123201=Locking software
123203=Boss key
123204=Open/hide the main window
123205=Open/hide mini window
123206=Screenshots
123221=Switch tab
123222=Return to the previous category
123223=One-click share screenshot
123301=Buy
123302=Sell
123303=Price input box value plus (+)
123304=Price input box value minus (-)
123305=Quantity input box value plus (+)
123306=Quantity input box value minus (-)
123307=Fill in the sell one price and set the focus to the buy button
123308=Fill in the buy one price and set the focus to the sell button
123309=Fill in the buy one price and set the focus to the buy button
123310=Fill in the sell one price and set the focus to the sell button
123311=Fill in the sell one price and the maximum buyable qty and set the focus to the buy button
123312=Fill in the buy one price and the maximum sellable qty and set the focus to the sell button
123313=Buy maximum buyable
123314=Sell maximum sellable
123315=Order price plus one price (+)
123316=Order price minus one price (-)
123317=Edit
123318=Cancel
123319=Expired
123320=Effective
123331=Cancel the most recent revocable order
123332=All withdrawals
123333=All failed
123334=Take effect
123335=Change the order window to quickly withdraw the order and close the window
123336=Open the most recent order that can be changed
123337=Buy 1/2 maximum buyable
123338=Buy 1/4 maximum buyable 
123339=Buy maximum buy on cash
123340=Buy 1/2 maximum buy on cash
123341=Buy 1/4 maximum buy on cash
123342=Sell 1/2 maximum sellable
123343=Sell 1/4 maximum sellable
123344=Fill in the maximum buyable
123345=Fill in the 1/2 maximum buyable
123346=Fill in the 1/4 maximum buyable
123347=Fill in the maximum buy on cash
123348=Fill in the 1/2 maximum buy on cash
123349=Fill in the 1/4 maximum buy on cash
123350=Fill in the maximum sellable
123351=Fill in the 1/2 maximum sellable
123352=Fill in the 1/4 maximum sellable

123371=Fill in the usual number one
123372=Fill in the usual number two
123373=Fill in the usual number three
123374=Fill in the usual number four
123375=Fill in the usual number five
123376=Fill in the usual number six
123377=Fill in the usual number seven
123378=Fill in the usual number eight
123379=Fill in the usual number nine
123380=Fill in the usual number ten
123381=The price of a recent changeable order plus a price and submit (+)
123382=The price of a recent changeable order is reduced by one price and submitted (-)
123383=Close
123384=Buy one at rival price
123385=Buy one at market price
123386=Sell one at rival price
123387=Sell one at market price
123388=Close at rival price
123389=Close at market price
123390=Close at specified price
123391=Reversing at rival price
123392=Reversing at market price
123393=Rolling at rival price
123394=Liquidate at rival price
123395=Liquidate at market price
123401=Switch time sharing, K line
123402=Transformation analysis cycle
123403=Zoom in on K line or reduce continuous multi-day time
123404=Zoom out K line or increase continuous multi-day time
123405=Move to the left
123406=Move to the right
123408=Transform time-sharing
123409=Join to the stock of choice
123410=Open stock window
123411=Open trading window
123412=Join to the stock of choice
123413=Delete the stock of choice
123414=Switch multiple strands
123416=Open Turbo King
123417=Fast left shift 10 cycles
123418=Fast right shift 10 cycles
123419=Historical time-sharing window shows the day before
123420=Historical time-sharing window shows the next day
123421=Basic stock information
123422=Price reminders
123423=Variety superposition
123424=Switching right
123425=Flip coordinates
123426=Curve translation
123427=Switch full screen
123430=1 minute K line
123431=5 minutes K line
123432=15 minutes K line
123433=30 minutes K line
123434=60 minutes K line
123435=Day K line
123436=Week K line
123437=Month K line
123438=3 minutes K line
123439=Season K line
123440=Year K line
123441=120 minutes K line
123442=4 hours K line
123500=Enable Lv2
123501=Continue
123502=Quote status tips
123503=The real-time market of Hong Kong stocks Lv2 is occupied by other terminals.
123504=Buy Lv2
123520=Position Trading Risk Reminder Settings:
123521=The frequency of the day's risk reminder:
123522=The difference between the positive stock and the recovered price is less than or equal to
123523=The number of days from the last trading day is less than or equal to
123524=The proportion of loss of positions in stocks is greater than or equal to
123525=%
123526=Day
123527=%
123528=Only remind once
123529=Continuously
123530=Risk reminder
123531=Position trading risk reminder
123532=The relevant positive stock and the stock's recovery price of %.2f difference %.2f reached a risk alert of less than or equal to %f%%.
123533=The stock has %d days from the last trading day and reaches the risk alert of less than or equal to %d days.
123534=Loss %.2f, loss ratio is %.2f%%, reaching the risk alert of greater than or equal to %f%%.
123535=Previous
123536=next
123537=Don't remind me again
151001=\r\nReceived message from %s(%lld): \r\n %s
151002=\r\nYou have new friends, double click to view
151020=Chat room (%d)
151021=Let's talk !
151022=(%d)
151030=Delete chat
151031=View friend profile
151032=messages
151050=Yesterday
151051=New Friends
151052=Friend
151053=Group that I created
151054=Group that I joined
151055=No friends
151060=Friend Confirmation Setting
151061=Agree
151062=Add
151063=Waiting for verification
151064=Request sent, waiting for verification
151065=Added
151066=You have added him(her) as a friend
151067=He(She) requests to add you as a friend.
151068=He(She) has added you as a friend
151069=Both parties have been added as friends
151070=Delete Record
151101=Delete Friends
151102=Message
151103=Mute Notifications
151104=Message Notifications
151105=Exit Group
151107=Exit
151108=Cancel
151109=View group homepage
151110=Message Notifications
151111=Mute Notifications
151112=The chat history will be deleted and you will no longer receive the message after you exit the chat group. Are you sure to exit?
151113=%s left this group
151114=Group owner %s removed %s from this group
151115=Admin %s removed %s from this group
151116=%s joined this group
151117=you
151118=Group owner %s set %s as admin
151119=Group owner %s removed %s from admin
151120=Group owner edited group avatar
151121=Group owner edited group name
151122=Group owner edited group introduction
151123=Group owner dismissed this group
151124=and
151125=,
151201=This user is already your friend
151202=Existing requests, please check the processing in new friends
151203=Processing request...
151204=You successfully added him(her) as a friend
151205=Processing request...
151206=The request has been sent, waiting for his/her confirmation.
151207=He(She) refuses to add anyone as a friend
151208=Add failed, unknown error.
151209=Start chatting
151210=-Add friends
151250=cannot add youself as a friend
151301=Delete Friends
151302=Are you sure to delete the following contacts? They will not be notified because it is an one-way action.
152400=It requires %d growth value to upgrade the HK Stocks badge
152401=Open a HK Stocks account to light the badge
152402=It requires %d growth value to upgrade the US Stocks badge
152403=Open a US Stocks account to light the badge
152404=It requires %d growth value to upgrade the duration badge
152405=Accumulate online for 30 minutes to light the badge
152406=It requires %d growth value to upgrade the trade badge
152407=Save money by depositing funds
152408=It requires %d growth value to upgrade the commission-free badge
152409=Commission-free badge
152410=It requires %d growth value to upgrade the fortune badge
152411=Fortune badge, you can get points to light up
152500=Login with Twitter
152501=Login with QQ
152502=Login with Wechat
152503=Login with Weibo
152504=Login with Facebook
152505=Log in Futubull Cooperative A/C
152506=Log in existing account and bind
152507=No Futbull account yet, sign up now
152508=Logged in via QQ account
152509=Logged in via WeChat account
152510=Logged in via Weibo account
152511=Logged in via Facebook account
152512=Logged in via Twitter account
152513=Congratulations, you've successfully registered Futubull account: 
152514=Registration failed, please try again later
152515=Start using
152516=Return to the login window
152517=Please wait while registering
152518=Login with XiaoMi
152519=Logged in via Xiaomi account
152520=Login with Google
152521=Logged in via Google account
153350=Back>>
153351=Adaptive
153352=Recently closed
153354=Recently closed tag
153355=Blank page
153356=Blank tab
153357=Stock page
153358=Stock selection page
153359=Customize
153360=Save time:
153361=Closing time:
153362=More>>
153363=All
153364=System
153365=Me
153366=Import
154380=Trade badge
154381=HK stocks badge
154382=US stocks badge
154383=Duration badge
154384=Commission-free badge
154385=Fortune badge
155001=New Friends
155002=You have %d new friends messages
155100=Function key
155101=1 minute
155102=5 minutes
155103=15 minutes
155104=30 minutes
155105=60 minutes
155106=Daily line
155107=Weekly line
155108=Monthly line
155109=Annual line
155110=Featured topics
155201=Comment
155202=The current content will not be saved, are you sure to quit?
155203=Published successfully
155204=Confirm
155205=Sign out
155300=The transaction was cancelled
155301=Ordinary
155302=Enhance
155303=Particular
155400=Valid Date
155401=Trend
155402=Target$
155403=Order will submit if above conditions are met.
155404=Dropped＞
155405=Price Type
155406=Fill outside RTH
155407=LMT
155408=Yes
155409=No
155410=Rise to
155411=Fall to
155412=Within One Week
155413=Within Two Weeks
155414=Within 30 Days
155415=Valid Date(ET)
155416=Pre
155417=Post
155418=Order Description@Order Group ID
155419=Chg. ＞
155420=Reset
155421=Set time
155422=Additional Options
155423=Time-in-force
155424=Day
155425=Good till Cancel
155426=Pre-Market
155427=The enhanced limit order submitted from 16:10 on T day to 9:15 on T + 1 day is the pre-defined order. It is submitted to the Exchange as an auction limit order during the Pre-opening Auction session (9: 00-9: 15 Beijing time) to participate in the auction matching. 9: 15-9: 30 is the exchange auction matching period. During this period, order modification and cancellation will not be supported. Please be informed.
155428=The enhanced limit order submitted from 16:10 on T day to 9:30 on T + 1 day is the pre-defined order. The pre-defined order will be put in the price queue for submission to the Exchange after 9:30 (Beijing time). The waiting time may be up to several minutes. Please be patient. If you want the order to be submitted more quickly, it is recommended to check the Allow Pre-market Option, or to cancel the order after 9:30 (Beijing time) and place the order again.
155430=Failed with unknown reasons. Please contact the customer service and inform the order type, symbol and operation time to locate the cause of failure.
155431=CN Phone number: 400-870-1818
155432=HK Phone number: 852-2523-3588
155433=Send an email to: cs@fututrade.com
155434=Feedback
155435=Help Center
155440=Are you sure to switch to Ping An Bank stock test environment?
155441=Are you sure to reset the software to the initial default interface?
155450=Search for account number
155451=Account number
155452=Alias
155453=Market
155454=Operation
155455=Select
155456=Please enter a 16-digit number account
155500=Developer mode
155501=Trade and Base
155502=Social
155510=Production environment
155511=Test environment
155512=The current environment is: 
155513=Switch to
155514=Note: After switching the environment, you need to restart the application to take effect.
155515=Are you sure to switch environment to %s?
155600=Custom Offer
155601=Display Mode
155602=Custom
155603=Quote
155604=Ticker
155605=BidAsk
155606=Broker
155607=Charts
155608=You can add or cut or darg
155609=Component Mode
155610=Component Element
155611=Wide
155612=Narrow
155613=Variable 
155614=A
155615=B
155616=C
155617=Please add
155618=None
155640=2 Days
155641=7 Days
155660=My Buy Orders
155661=My Sell Orders
155662=Bid QTY
155663=Ask QTY
155664=Next step
155665=Got it
155666=Left click to place orders
155667=Drag up and down to change orders
155668=Right click to cancel the selected orders
155700=Please type a URL
155701=Reload this page
155702=Usage guide
155703=There is an error in URL. Please refer to the
155704=The web page you want to visit will be loaded here
155705=Please type a URL in the address bar above and press enter to confirm
155706=Futubull WEB module could not find the server
155707=The url is wrong.
155708=No page for the time being
155801=Draw-Line Trade
155802=Position cost line
155803=Condition order line
155804=Order line
155805=Please choose.
155806=Draw-Line Trade
155807=Drag the position line to set the condition order
155808=Drag the position line to set the second confirmation
155809=After closing, the conditional order will be set according to the validity period and order price set here. For any loss caused by closing the second confirmation reminder, Futu need not bear any responsibility.
155810=No second confirmation, the follow-up will be: contract qty, %s , %s  to set order, which can be changed on the setting page 
155811=Draw-Line Price
155812=Draw-line price cannot be the same as the current price, please set it again
155813=Modify condition order
155814=Set condition order
155815=Limit(rival)
155816=Limit(mkt)
155817=Drag here to cancel the operation
155818=Release the mouse to cancel the operation
155819=Step 1: Enter relevant information in the operation box and select the order direction
155820=Step 2: Draw a line in the trend chart and confirm by left click
155821=Step 3: Confirm and complete the order 
155822=Drag the small window up or down to quickly adjust the trigger price or set the take profit and stop loss (limit price)
155823=Right click to quickly modify or delete
155824=Submit
155825=Delete
155826=The draw-line function has been turned on. If you need to perform draw-line trading operations, you can operate after turning off the draw-line function.
155827=The draw-line trading function has been turned on. If you need to perform draw-line operations, you can operate after turning off the draw-line trading function.
155828=Corresponding contract qty
155860=Option trading reminder
155861=1. Futu currently does not support short selling stocks for HK stock options exercise. \n2. If you hold in-the-money (or close to in-the-money) options which may result in short underlying position after exercise, please close the options position or open sufficient underlying position 2 working days before the expiry date. Otherwise, Futu has the right to close such options position without further notice. \n3. For risk management purpose, Futu will recalculate your required margin in accordance with the margin requirement after the exercise of your in-the-money (or close to in-the-money) options, starting from the working day before the expiry date. Please note that Futu has the right to close such options position without further notice if a margin call is triggered during above period.
155862=For risk management purpose, Futu will recalculate your required margin in accordance with the margin requirement after the exercise of your in-the-money (or close to in-the-money) options, starting 3 hours prior to the close of the expiry date. Please note that Futu has the right to close such options position without further notice if a margin call is triggered during above period.
155870=Wheel Settings
155871=Scroll mouse wheel to zoom in/out 
155872=Scroll mouse wheel to switch items
155873=3
155874=789
